admin/backend/controllers/AdviceController.php

SELECT COUNT(*) FROM `tcs_advice`
SELECT * FROM `tcs_advice` LIMIT 3
---
    public function actionIndex(){
            //查询数据中的数据进行分页展示
            $query = Advice::find();
            $countQuery = clone $query;
            $pages = new Pagination(['totalCount' => $countQuery->count()]);
            $models = $query->offset($pages->offset)
                     ->limit($pages->limit)
                     ->all();