admin/backend/controllers/ManController.php

    public function actionIndex(){
        $request=Yii::$app->request;
        if($request->isPost){
            $id=$request->post('id');
            $man_examine=$request->post('man_examine');
            if($man_examine==0){
                $examine=1;
            }else{
                $examine=0;
            }
            $sql="update tcs_man set man_examine='$examine' where man_id='$id'";
            $data=Yii::$app->db->createCommand($sql)->query();
            if($data){
                echo "OK";
            }
        }else{
            $user = new Man();
            // 查询总数
            $user_count = $user->find()->where('man_del=0')->count();
---
SELECT COUNT(*) FROM `tcs_man` WHERE man_del=0

    public function actionDel(){
        $request=Yii::$app->request;
        if($request->isPost){
            $msg=$request->post('msg');
            if($msg==1){
                $id=$request->post('id');
                $sql="update tcs_man set man_del=0 where man_id='$id'";
                $data=Yii::$app->db->createCommand($sql)->query();
            }else{
                $id=$request->post('id');
                $sql="update tcs_man set man_del=1 where man_id='$id'";
                $data=Yii::$app->db->createCommand($sql)->query();
            }
            if($data){
                echo "OK";
            }else{
                echo "ON";
            }
        }else{
            $user = new Man();
            // 查询总数
            $user_count = $user->find()->where('man_del=1')->count();
---
SELECT COUNT(*) FROM `tcs_man` WHERE man_del=1